export-ornametals/app/controllers/calculates_controller.rb

  def index
    calcular
    @calculates = Calculate.all
---
SELECT "calculates".* FROM "calculates"

  def create
    @calculate = Calculate.new(calculate_params)

    respond_to do |format|
      if @calculate.save
---
INSERT INTO "calculates" ("number", "temp_carry", "cant_container", "Plant_id", "Containert_id", "Way_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_calculate
      @calculate = Calculate.find(params[:id])
---
SELECT  "calculates".* FROM "calculates" WHERE "calculates"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]