export-ornametals/app/controllers/containerts_controller.rb

SELECT "containerts".* FROM "containerts"
---
  def index
    @containerts = Containert.all

INSERT INTO "containerts" ("depreciation", "m_area", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["depreciation", 9.0], ["m_area", 12.0], ["created_at", 2017-04-27 07:03:48 UTC], ["updated_at", 2017-04-27 07:03:48 UTC]]
---
  def create
    @containert = Containert.new(containert_params)

    respond_to do |format|
      if @containert.save

UPDATE "containerts" SET "m_area" = ?, "updated_at" = ? WHERE "containerts"."id" = ?  [["m_area", 13.0], ["updated_at", 2017-04-27 07:14:13 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @containert.update(containert_params)

DELETE FROM "containerts" WHERE "containerts"."id" = ?  [["id", 6]]
---
  def destroy
    @containert.destroy

SELECT  "containerts".* FROM "containerts" WHERE "containerts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_containert
      @containert = Containert.find(params[:id])