export-ornametals/app/controllers/plants_controller.rb

INSERT INTO "plants" ("variant", "temperature", "m_area", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["variant", "Gizmo"], ["temperature", 12.0], ["m_area", 10.0], ["created_at", 2017-04-23 09:17:47 UTC], ["updated_at", 2017-04-23 09:17:47 UTC]]
---
  def create
    @plant = Plant.new(plant_params)

    respond_to do |format|
      if @plant.save

UPDATE "plants" SET "variant" = ?, "m_area" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["variant", "editado"], ["m_area", 11.0], ["updated_at", 2017-04-27 05:36:43 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @plant.update(plant_params)

DELETE FROM "plants" WHERE "plants"."id" = ?  [["id", 16]]
---
  def destroy
    @plant.destroy

SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def set_plant
      @plant = Plant.find(params[:id])