export-ornametals/app/controllers/ways_controller.rb

SELECT "ways".* FROM "ways"
---
  def index
    @ways = Way.all

INSERT INTO "ways" ("distance", "stopes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["distance", 400.0], ["stopes", 2.0], ["created_at", 2017-04-28 06:25:36 UTC], ["updated_at", 2017-04-28 06:25:36 UTC]]
---
  def create
    @way = Way.new(way_params)

    respond_to do |format|
      if @way.save